scientific_groups = [{'group': 'Вычислительный эксперимент в оптике',
                      'callback': 'science_group_computational_experiment_in_optic'},

                     {'group': 'Квантовая оптика и нанофотоника',
                      'callback': 'science_group_quantum_optics_and_nanophotonics'},

                     {'group': 'Группа биомедицинской фотоники',
                      'callback': 'science_group_biomedical_photonics'},

                     {'group': 'Органическая электроника',
                      'callback': 'science_group_organic_electronic'},

                     {'group': 'Квантовая оптика',
                      'callback': 'science_group_experimental_and_theoretical_quantum_optic'},

                     {'group': 'Теоретические проблемы оптики',
                      'callback': 'science_group_theoretical_problems_of_optic'},

                     {'group': 'Нелинейная поляризационная оптика',
                      'callback': 'science_group_nonlinear_polarization_optic'},

                     {'group': 'Фотоника и нелинейная спектроскопия',
                      'callback': 'science_group_photonic_and_nonlinear_spectroscopy',
                      'about': 'Группа ведет научную работу в области нелинейной оптики и лазерной '
                               'физики, нелинейно оптической микроскопии и спектроскопии, волоконной '
                               'оптики, биофотоники, квантовой оптики, физики сверхсильных световых '
                               'полей, включая вопросы генерации сверхмощных и предельно коротких '
                               'импульсов и их приложений для исследования фундаментальных вопросов '
                               'взаимодействия с веществом. Наряду с интенсивными экспериментальными '
                               'работами ведутся активные теоретические исследования и численное '
                               'суперкомпьютерное моделирование.',
                      'main_picture': 'AgACAgIAAxkBAAIBQWX4HvJxZBeov_E_nrTx'
                                      '-WPArOzDAALV2jEbcPfAS3xnMHM1awi4AQADAgADeAADNAQ',
                      'buttons': {'areas': [{'text': 'Оптика сверхкоротких импульсов\n\n'
                                                     'Научной группой лаборатории разработан и создан уникальный лазерный '
                                                     'источник субтераваттных сверхкоротких импульсов среднего инфракрасного '
                                                     'излучения.',
                                             'picture': 'AgACAgIAAxkBAAIBQ2X4JDYB3TCW8OcqNc6kjwmeD1fxAALo2jEbcPfAS5eMovoIn4GOAQADAgADeAADNAQ'},

                                            {'text': 'Аттосекундная спектрохронография\n\n'
                                                     'Использование импульсов среднего ИК-диапазона открывает принципиально новые '
                                                     'возможности для оптической диагностики быстропротекающих процессов в '
                                                     'веществе, включая явления аттосекундной электронной динамики в газах и '
                                                     'твердом теле.',
                                             'picture': 'AgACAgIAAxkBAAIBhWX586Nn6VLjuhxd1uRArzv1u33BAAIK2TEbrhrQS8JEE1DC_zRtAQADAgADeAADNAQ'},

                                            {'text': 'Нейрофотоника: оптические методы исследования мозга\n\n'
                                                     'Методы оптической физики открывают уникальные возможности для исследования '
                                                     'мозга и высшей нервной деятельности. На стыке передовых лазерных '
                                                     'технологий и современной нейробиологии стремительно развивается новое '
                                                     'междисциплинарное направление естественнонаучных исследований – нейрофотоника.',
                                             'picture': 'AgACAgIAAxkBAAIBh2X59BXHJbjwPB8Tih4JUGZZjczZAAIL2TEbrhrQS7ua'
                                                        '-NK6_iGAAQADAgADeAADNAQ'},

                                            {'text': 'Мультимодальная нелинейно-оптическая микроскопия\n\n'
                                                     'Одной из главных задач исследований в этом направлении является разработка '
                                                     'новых оптических методов для мультимодального количественного анализа '
                                                     'биохимических, физико-химических и термодинамических параметров '
                                                     'биологических систем как основы для исследования молекулярных и клеточных '
                                                     'механизмов заболеваний и развития патологических состояний мозга.',
                                             'picture': 'AgACAgIAAxkBAAIBiWX59HQ2bV9yicckhMG7MFADKMKcAAIM2TEbrhrQS8mbbQxFKSiLAQADAgADbQADNAQ'},

                                            {'text': 'Петагерцовая оптоэлектроника\n\n'
                                                     'Прогресс в области оптической физики и лазерных технологий приводит к '
                                                     'созданию уникального инструментария для исследования быстропротекающих '
                                                     'явлений, позволяющего регистрировать сверхбыстрые переходные процессы с '
                                                     'временным разрешением на уровне нескольких десятков аттосекунд.',
                                             'picture': 'AgACAgIAAxkBAAIBi2X59LFu_2OKHnFrPJWQBFJ0hNvlAAIS2TEbrhrQS9Gbst1amrTjAQADAgADbQADNAQ'}],

                                  'contacts': 'Корпус нелинейной оптики (КНО)\n'
                                              'Комнаты:\n'
                                              '    5-08    +7-495-939-39-59\n'
                                              '    3-12    +7-495-939-16-30\n'
                                              '    2-03    +7-495-939-51-470\n\n'
                                              'Федотов Андрей Борисович:  a.b.fedotov@physics.msu.ru',

                                  'courseworks': [
                                      '1. Волоконные квантовые сенсоры в задачах термометрии (эксперимент + теория)\n\n'
                                      '👨‍💼: Федотов И.В.\n'
                                      '📍: КНО, каб. 3-12\n\n\n'
                                      ''
                                      '2. Исследование сверхбыстрых конформационных изменений биомолекул методом '
                                      'двумерной инфракрасной спектроскопии (эксперимент + теория)\n\n'
                                      '👨‍💼: Федотов А.Б.\n'
                                      '📍: каб. 5-08\n\n\n'
                                      ''
                                      '3. Нелинейно-оптическая микроскопия тканей мозга сверхвысокого '
                                      'пространственного разрешения  (эксперимент + теория)\n\n'
                                      '👨‍💼: Ланин А.А., Федотов А.Б.\n'
                                      '📍: КНО, каб. 3-12, каб. 5-08\n\n\n'
                                      ''
                                      '4. Исследование широкополосных однофотонных состояний (эксперимент + теория)\n\n'
                                      '👨‍💼: Федотов А.Б., Федотов И.В.\n'
                                      '📍: КНО, каб. 5-08, каб. 3-12',

                                      '5. Обратимые осцилляции фототока в диэлектриках и полупроводниках для задач '
                                      'петагерцовой электроники (эксперимент + теория)\n\n'
                                      '👨‍💼: Ланин А.А., Федотов А.Б.\n'
                                      '📍: КНО, каб. 3-12, каб. 5-08\n\n\n'
                                      ''
                                      '6. Многосердцевинные световоды для визуализации и стимуляции отдельных '
                                      'нейронов и астроцитов живых животных (эксперимент + теория)\n\n'
                                      '👨‍💼: Федотов И.В., Федотов А.Б.\n'
                                      '📍: КНО, каб. 3-12, каб. 5-08\n\n\n'
                                      ''
                                      '7. Новая нелинейная оптика субтераваттных сверхкоротких импульсов среднего '
                                      'инфракрасного диапазона (эксперимент + теория)\n\n'
                                      '👨‍💼: Федотов А.Б., Сидоров-Бирюков Д.А., Воронин А.А.\n'
                                      '📍: КНО, каб. 5-08, каб. 3-12',

                                      'И множество других тематик, связанных с взаимодействием сверхкоротких лазерных '
                                      'импульсов видимого и ИК диапазонов с веществом в газообразном и твердом '
                                      'состояниях. Разработка новых световодных компонент и методов оптической '
                                      'визуализации и стимуляции тканей осуществляется в тесном сотрудничестве с '
                                      'молекулярными биологами и нейрофизиологами из НИЦ «Курчатовский институт» и '
                                      'Института биоорганической химии им. академиков М.М. Шемякина и Ю.А. Овчинникова '
                                      '(ИБХ) РАН.']}},
                     # Лазерная диагностика биомолекул и методов фотоники в исследовании объектов культурного наследия
                     {'group': 'Лазерная диагностика биомолекул',
                      'callback': 'science_group_laser_diagnostic_biomolecules'},

                     {'group': 'Нелинейная спектроскопия',
                      'callback': 'science_group_laser_system_and_nonlinear_spectroscopy'},

                     {'group': 'Терагерцовая оптоэлектроника',
                      'callback': 'science_group_THz_optoelectronics_and_spectroscopy'},

                     {'group': 'Сверхсильные световые поля',
                      'callback': 'science_group_super_strong_light_fields',
                      'about': 'Научная группа ведёт исследования в области физики взаимодействия мощного '
                               'фемтосекундного лазерного излучения с веществом, нелинейной оптики, а также в области '
                               'разработки и создания новых перспективных лазерных систем. История лаборатории берет '
                               'свое начало в 1986-м году, когда по инициативе зав. кафедрой ОФиВП профессора С.А. '
                               'Ахманова была создана лаборатория сверхсильных световых полей МГУ имени М.В. '
                               'Ломоносова. Группа сотрудничает с Курчатовским институтом,  Университетом Бордо, '
                               'Университетом Осаки, ФНИЦ «Кристаллография и Фотоника» РАН, ИПЛИТ РАН, ИОФ РАН.',
                      'main_picture': 'AgACAgIAAxkBAAIBQWX4HvJxZBeov_E_nrTx'
                                      '-WPArOzDAALV2jEbcPfAS3xnMHM1awi4AQADAgADeAADNAQ',
                      'buttons': {'areas': [{}],

                                  'contacts': '',

                                  'courseworks': []}},

                     {'group': 'Лазерная оптоакустика',
                      'callback': 'science_group_laser_optoacoustics'},

                     {'group': 'Релятивистская лазерная плазма',
                      'callback': 'science_group_relativistic_laser_plasma'},

                     {'group': 'Стохастические нелинейные процессы',
                      'callback': 'science_group_stochastic_nonlinear_processes'},

                     {'group': 'Центр измерительных технологий',
                      'callback': 'science_group_center_for_measuring_technologies'}]
